#include <stdio.h>
#include <time.h>
#include "helpComand.h"

void helpComand(char *argv[]) {
   time_t t;
   time(&t);
   printf("  ____________________________________________________\n");
   printf("|| Параметри запуску:                                 ||\n");
   printf("||          -u - Вказати URL радіостанції             ||\n");
   printf("||          -n - Вказати кастомне ім'я для станції    ||\n");
   printf("||          -p - Почати відтворення з № станції       ||\n");
   printf("||          -f - Відтворити один файл /шлях/файл.mp3   ||\n");
   printf("||          -l - Відтворити всі файли в папці         ||\n");
   printf("||          -? - Коротка довідка                      ||\n");
   printf("||          -h - Коротка довідка                      ||\n");
   printf("||____________________________________________________||\n");
   printf("|| Приклади використання:                             ||\n");
   printf("||   1. Читати та грати стандартний плейліст:         ||\n");
   printf("||      %s\n", argv[0]);
   printf("||   2. Відтворити один конкретний URL:               ||\n");
   printf("||      %s -u http://radio.fm\n", argv[0]);
   printf("||   3. Відтворити локальний файл:                    ||\n");
   printf("||      %s -f /tmp/music/track.mp3\n", argv[0]);
   printf("||   4. Відтворити всю папку з mp3:                   ||\n");
   printf("||      %s -l /tmp/music\n", argv[0]);
   printf("||____________________________________________________||\n\n");
   printf("        Поточний час системи: %s", ctime(&t));
}

